---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LinePattern
source: html/7ff8bb7e-bff0-b343-a147-74394fa3d5c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LinePattern Property

"Line Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId LinePattern { get; }
```